part-2-prelim-soln/unsteady/system/blockMeshDict
// Mesh generated on 2021-04-01

// Lf (fore)  = 4.0
// Lw (wake)  = 10.0
// R  (outer) = 1.0
// H  (top/bottom) = 4.0
// res = 1.0

FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    (  5.0000000000e-01   0.0000000000e+00  -5.0000000000e-01) // 0 
    (  3.5355339059e-01   3.5355339059e-01  -5.0000000000e-01) // 1 
    (  0.0000000000e+00   5.0000000000e-01  -5.0000000000e-01) // 2 
    ( -3.5355339059e-01   3.5355339059e-01  -5.0000000000e-01) // 3 
    ( -5.0000000000e-01   0.0000000000e+00  -5.0000000000e-01) // 4 
    ( -3.5355339059e-01  -3.5355339059e-01  -5.0000000000e-01) // 5 
    (  0.0000000000e+00  -5.0000000000e-01  -5.0000000000e-01) // 6 
    (  3.5355339059e-01  -3.5355339059e-01  -5.0000000000e-01) // 7 
    (  1.0000000000e+00   0.0000000000e+00  -5.0000000000e-01) // 8 
    (  7.0710678119e-01   7.0710678119e-01  -5.0000000000e-01) // 9 
    (  0.0000000000e+00   1.0000000000e+00  -5.0000000000e-01) // 10 
    ( -7.0710678119e-01   7.0710678119e-01  -5.0000000000e-01) // 11 
    ( -1.0000000000e+00   0.0000000000e+00  -5.0000000000e-01) // 12 
    ( -7.0710678119e-01  -7.0710678119e-01  -5.0000000000e-01) // 13 
    (  0.0000000000e+00  -1.0000000000e+00  -5.0000000000e-01) // 14 
    (  7.0710678119e-01  -7.0710678119e-01  -5.0000000000e-01) // 15 
    (  1.0000000000e+01   0.0000000000e+00  -5.0000000000e-01) // 16 
    (  1.0000000000e+01   7.0710678119e-01  -5.0000000000e-01) // 17 
    (  1.0000000000e+01   4.0000000000e+00  -5.0000000000e-01) // 18 
    (  7.0710678119e-01   4.0000000000e+00  -5.0000000000e-01) // 19 
    (  0.0000000000e+00   4.0000000000e+00  -5.0000000000e-01) // 20 
    ( -7.0710678119e-01   4.0000000000e+00  -5.0000000000e-01) // 21 
    ( -4.0000000000e+00   4.0000000000e+00  -5.0000000000e-01) // 22 
    ( -4.0000000000e+00   7.0710678119e-01  -5.0000000000e-01) // 23 
    ( -4.0000000000e+00   0.0000000000e+00  -5.0000000000e-01) // 24 
    ( -4.0000000000e+00  -7.0710678119e-01  -5.0000000000e-01) // 25 
    ( -4.0000000000e+00  -4.0000000000e+00  -5.0000000000e-01) // 26 
    ( -7.0710678119e-01  -4.0000000000e+00  -5.0000000000e-01) // 27 
    (  0.0000000000e+00  -4.0000000000e+00  -5.0000000000e-01) // 28 
    (  7.0710678119e-01  -4.0000000000e+00  -5.0000000000e-01) // 29 
    (  1.0000000000e+01  -4.0000000000e+00  -5.0000000000e-01) // 30 
    (  1.0000000000e+01  -7.0710678119e-01  -5.0000000000e-01) // 31 
    (  5.0000000000e-01   0.0000000000e+00   5.0000000000e-01) // 32 
    (  3.5355339059e-01   3.5355339059e-01   5.0000000000e-01) // 33 
    (  0.0000000000e+00   5.0000000000e-01   5.0000000000e-01) // 34 
    ( -3.5355339059e-01   3.5355339059e-01   5.0000000000e-01) // 35 
    ( -5.0000000000e-01   0.0000000000e+00   5.0000000000e-01) // 36 
    ( -3.5355339059e-01  -3.5355339059e-01   5.0000000000e-01) // 37 
    (  0.0000000000e+00  -5.0000000000e-01   5.0000000000e-01) // 38 
    (  3.5355339059e-01  -3.5355339059e-01   5.0000000000e-01) // 39 
    (  1.0000000000e+00   0.0000000000e+00   5.0000000000e-01) // 40 
    (  7.0710678119e-01   7.0710678119e-01   5.0000000000e-01) // 41 
    (  0.0000000000e+00   1.0000000000e+00   5.0000000000e-01) // 42 
    ( -7.0710678119e-01   7.0710678119e-01   5.0000000000e-01) // 43 
    ( -1.0000000000e+00   0.0000000000e+00   5.0000000000e-01) // 44 
    ( -7.0710678119e-01  -7.0710678119e-01   5.0000000000e-01) // 45 
    (  0.0000000000e+00  -1.0000000000e+00   5.0000000000e-01) // 46 
    (  7.0710678119e-01  -7.0710678119e-01   5.0000000000e-01) // 47 
    (  1.0000000000e+01   0.0000000000e+00   5.0000000000e-01) // 48 
    (  1.0000000000e+01   7.0710678119e-01   5.0000000000e-01) // 49 
    (  1.0000000000e+01   4.0000000000e+00   5.0000000000e-01) // 50 
    (  7.0710678119e-01   4.0000000000e+00   5.0000000000e-01) // 51 
    (  0.0000000000e+00   4.0000000000e+00   5.0000000000e-01) // 52 
    ( -7.0710678119e-01   4.0000000000e+00   5.0000000000e-01) // 53 
    ( -4.0000000000e+00   4.0000000000e+00   5.0000000000e-01) // 54 
    ( -4.0000000000e+00   7.0710678119e-01   5.0000000000e-01) // 55 
    ( -4.0000000000e+00   0.0000000000e+00   5.0000000000e-01) // 56 
    ( -4.0000000000e+00  -7.0710678119e-01   5.0000000000e-01) // 57 
    ( -4.0000000000e+00  -4.0000000000e+00   5.0000000000e-01) // 58 
    ( -7.0710678119e-01  -4.0000000000e+00   5.0000000000e-01) // 59 
    (  0.0000000000e+00  -4.0000000000e+00   5.0000000000e-01) // 60 
    (  7.0710678119e-01  -4.0000000000e+00   5.0000000000e-01) // 61 
    (  1.0000000000e+01  -4.0000000000e+00   5.0000000000e-01) // 62 
    (  1.0000000000e+01  -7.0710678119e-01   5.0000000000e-01) // 63 
);

blocks
(
    // block 0
    hex (0 8 9 1 32 40 41 33) (10 20 1)  simpleGrading (2.0 1.0 1.0)

    // block 1
    hex (1 9 10 2 33 41 42 34) (10 20 1)  simpleGrading (2.0 1.0 1.0)

    // block 2
    hex (2 10 11 3 34 42 43 35) (10 20 1)  simpleGrading (2.0 1.0 1.0)

    // block 3
    hex (3 11 12 4 35 43 44 36) (10 20 1)  simpleGrading (2.0 1.0 1.0)

    // block 4
    hex (4 12 13 5 36 44 45 37) (10 20 1)  simpleGrading (2.0 1.0 1.0)

    // block 5
    hex (5 13 14 6 37 45 46 38) (10 20 1)  simpleGrading (2.0 1.0 1.0)

    // block 6
    hex (6 14 15 7 38 46 47 39) (10 20 1)  simpleGrading (2.0 1.0 1.0)

    // block 7
    hex (7 15 8 0 39 47 40 32) (10 20 1)  simpleGrading (2.0 1.0 1.0)

    // block 8
    hex (8 16 17 9 40 48 49 41) (30 20 1)  simpleGrading (4.0 1.0 1.0)

    // block 9
    hex (9 17 18 19 41 49 50 51) (30 30 1)  simpleGrading (4.0 4.0 1.0)

    // block 10
    hex (10 9 19 20 42 41 51 52) (20 30 1)  simpleGrading (1.0 4.0 1.0)

    // block 11
    hex (11 10 20 21 43 42 52 53) (20 30 1)  simpleGrading (1.0 4.0 1.0)

    // block 12
    hex (23 11 21 22 55 43 53 54) (15 30 1)  simpleGrading (0.25 4.0 1.0)

    // block 13
    hex (24 12 11 23 56 44 43 55) (15 20 1)  simpleGrading (0.25 1.0 1.0)

    // block 14
    hex (25 13 12 24 57 45 44 56) (15 20 1)  simpleGrading (0.25 1.0 1.0)

    // block 15
    hex (26 27 13 25 58 59 45 57) (15 30 1)  simpleGrading (0.25 0.25 1.0)

    // block 16
    hex (27 28 14 13 59 60 46 45) (20 30 1)  simpleGrading (1.0 0.25 1.0)

    // block 17
    hex (28 29 15 14 60 61 47 46) (20 30 1)  simpleGrading (1.0 0.25 1.0)

    // block 18
    hex (29 30 31 15 61 62 63 47) (30 30 1)  simpleGrading (4.0 0.25 1.0)

    // block 19
    hex (15 31 16 8 47 63 48 40) (30 20 1)  simpleGrading (4.0 1.0 1.0)

);

edges
(
    arc 0 1 (4.3301270189e-01  2.5000000000e-01  -5.0000000000e-01)
    arc 8 9 (8.6602540378e-01  5.0000000000e-01  -5.0000000000e-01)
    arc 32 33 (4.3301270189e-01  2.5000000000e-01  5.0000000000e-01)
    arc 40 41 (8.6602540378e-01  5.0000000000e-01  5.0000000000e-01)
    arc 1 2 (2.5000000000e-01  4.3301270189e-01  -5.0000000000e-01)
    arc 9 10 (5.0000000000e-01  8.6602540378e-01  -5.0000000000e-01)
    arc 33 34 (2.5000000000e-01  4.3301270189e-01  5.0000000000e-01)
    arc 41 42 (5.0000000000e-01  8.6602540378e-01  5.0000000000e-01)
    arc 2 3 (-2.5000000000e-01  4.3301270189e-01  -5.0000000000e-01)
    arc 10 11 (-5.0000000000e-01  8.6602540378e-01  -5.0000000000e-01)
    arc 34 35 (-2.5000000000e-01  4.3301270189e-01  5.0000000000e-01)
    arc 42 43 (-5.0000000000e-01  8.6602540378e-01  5.0000000000e-01)
    arc 3 4 (-4.3301270189e-01  2.5000000000e-01  -5.0000000000e-01)
    arc 11 12 (-8.6602540378e-01  5.0000000000e-01  -5.0000000000e-01)
    arc 35 36 (-4.3301270189e-01  2.5000000000e-01  5.0000000000e-01)
    arc 43 44 (-8.6602540378e-01  5.0000000000e-01  5.0000000000e-01)
    arc 4 5 (-4.3301270189e-01  -2.5000000000e-01  -5.0000000000e-01)
    arc 12 13 (-8.6602540378e-01  -5.0000000000e-01  -5.0000000000e-01)
    arc 36 37 (-4.3301270189e-01  -2.5000000000e-01  5.0000000000e-01)
    arc 44 45 (-8.6602540378e-01  -5.0000000000e-01  5.0000000000e-01)
    arc 5 6 (-2.5000000000e-01  -4.3301270189e-01  -5.0000000000e-01)
    arc 13 14 (-5.0000000000e-01  -8.6602540378e-01  -5.0000000000e-01)
    arc 37 38 (-2.5000000000e-01  -4.3301270189e-01  5.0000000000e-01)
    arc 45 46 (-5.0000000000e-01  -8.6602540378e-01  5.0000000000e-01)
    arc 6 7 (2.5000000000e-01  -4.3301270189e-01  -5.0000000000e-01)
    arc 14 15 (5.0000000000e-01  -8.6602540378e-01  -5.0000000000e-01)
    arc 38 39 (2.5000000000e-01  -4.3301270189e-01  5.0000000000e-01)
    arc 46 47 (5.0000000000e-01  -8.6602540378e-01  5.0000000000e-01)
    arc 7 0 (4.3301270189e-01  -2.5000000000e-01  -5.0000000000e-01)
    arc 15 8 (8.6602540378e-01  -5.0000000000e-01  -5.0000000000e-01)
    arc 39 32 (4.3301270189e-01  -2.5000000000e-01  5.0000000000e-01)
    arc 47 40 (8.6602540378e-01  -5.0000000000e-01  5.0000000000e-01)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (22 54 55 23)
            (23 55 56 24)
            (24 56 57 25)
            (25 57 58 26)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (18 50 49 17)
            (17 49 48 16)
            (16 48 63 31)
            (31 63 62 30)
        );
    }

    cylinder
    {
        type wall;
        faces
        (
            (0 32 33 1)
            (1 33 34 2)
            (2 34 35 3)
            (3 35 36 4)
            (4 36 37 5)
            (5 37 38 6)
            (6 38 39 7)
            (7 39 32 0)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (22 54 53 21)
            (21 53 52 20)
            (20 52 51 19)
            (19 51 50 18)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (26 58 59 27)
            (27 59 60 28)
            (28 60 61 29)
            (29 61 62 30)
        );
    }

);